задание 1

In [6]:
import numpy as np
import pandas as pd
arr=np.array([['лиза', '16','10p', 'English'], ['stasya', '15', '10p', 'tennis']])
arr2=pd.DataFrame(arr, columns=['name', 'age', 'class', 'hobby'])
arr2

     name age class    hobby
0    лиза  16   10p  English
1  stasya  15   10p   tennis

In [ ]:
import numpy as np
import pandas as pd
arr=np.array([['лиза', '16', 'English'], ['stasya', '15', 'tennis']])
arr2=pd.DataFrame(arr, columns=['name', 'age', 'hobby'])
arr3=arr2.drop([1])
arr3

   name age    hobby
0  лиза  16  English